# ConvertModelPathToUserVisiblePath Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelPathUtils..::..ConvertModelPathToUserVisiblePath Method
ModelPathUtils Class See Also
---
Gets a string version of the path of a given ModelPath.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static string ConvertModelPathToUserVisiblePath(
	ModelPath path
)
```

Visual Basic
---
```text
Public Shared Function ConvertModelPathToUserVisiblePath ( _
	path As ModelPath _
) As String
```

Visual C++
---
```text
public:
static String^ ConvertModelPathToUserVisiblePath(
	ModelPath^ path
)
```

# ### Parameters
path
    Type: Autodesk.Revit.DB..::..ModelPath A ModelPath representing a file path or a server path.
# ### Return Value
The path in string form
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ModelPathUtils Class
Autodesk.Revit.DB Namespace